In [1]:
import csv
import re

import numpy as np
import pandas as pd

In [8]:
frame = pd.DataFrame(
    np.arange(12).reshape((4, 3)),
    index=[["a", "a", "b", "b"], [1, 2, 1, 2]],
    columns=[["Ohio", "Ohio", "Colorado"], ["Green", "Red", "Green"]],
)
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [13]:
frame.index.names = ["key1", "key2"]
frame.columns.names = ["state", "color"]

In [14]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [7]:
frame.index.names

FrozenList(['key1', 'key2'])

In [15]:
frame.swaplevel("key1", "key2")

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [16]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [17]:
frame.index.levels

FrozenList([['a', 'b'], [1, 2]])

In [18]:
frame.index.levels[0]

Index(['a', 'b'], dtype='object', name='key1')

In [24]:
frame.swaplevel(0, 1)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [25]:
frame.swaplevel(0, 1).sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [2]:
s1 = pd.Series([0, 1], index=["a", "b"], dtype="Int64")
s2 = pd.Series([2, 3, 4], index=["c", "d", "e"], dtype="Int64")
s3 = pd.Series([5, 6], index=["f", "g"], dtype="Int64")

In [3]:
s1

a    0
b    1
dtype: Int64

In [4]:
s2

c    2
d    3
e    4
dtype: Int64

In [5]:
s3

f    5
g    6
dtype: Int64

In [8]:
pd.concat([s1, s1, s3], keys=["one", "two", "three"])

one    a    0
       b    1
two    a    0
       b    1
three  f    5
       g    6
dtype: Int64

In [9]:
df1 = pd.DataFrame(np.random.standard_normal((3, 4)), columns=["a", "b", "c", "d"])

df2 = pd.DataFrame(np.random.standard_normal((2, 3)), columns=["b", "d", "a"])

In [10]:
df1

          a         b         c         d
0  0.993656 -1.089930 -0.348214 -0.037440
1 -2.474380  3.115250  0.269315  1.030479
2  1.248545  0.347351  0.488464  1.407158

In [11]:
df2

          b         d         a
0 -1.660129 -0.671219  0.755499
1 -0.150297 -0.055102  1.500934

In [12]:
pd.concat([df1, df2])

          a         b         c         d
0  0.993656 -1.089930 -0.348214 -0.037440
1 -2.474380  3.115250  0.269315  1.030479
2  1.248545  0.347351  0.488464  1.407158
0  0.755499 -1.660129       NaN -0.671219
1  1.500934 -0.150297       NaN -0.055102

In [13]:
pd.concat([df1, df2], ignore_index=True)

          a         b         c         d
0  0.993656 -1.089930 -0.348214 -0.037440
1 -2.474380  3.115250  0.269315  1.030479
2  1.248545  0.347351  0.488464  1.407158
3  0.755499 -1.660129       NaN -0.671219
4  1.500934 -0.150297       NaN -0.055102

In [14]:
df1 = pd.DataFrame(
    {
        "a": [1.0, np.nan, 5.0, np.nan],
        "b": [np.nan, 2.0, np.nan, 6.0],
        "c": range(2, 18, 4),
    }
)

df2 = pd.DataFrame(
    {"a": [5.0, 4.0, np.nan, 3.0, 7.0], "b": [np.nan, 3.0, 4.0, 6.0, 8.0]}
)

In [15]:
df1

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14

In [16]:
df2

     a    b
0  5.0  NaN
1  4.0  3.0
2  NaN  4.0
3  3.0  6.0
4  7.0  8.0

In [17]:
df1.combine_first(df2)

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

In [18]:
df1

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14

In [19]:
data = pd.DataFrame(
    np.arange(6).reshape((2, 3)),
    index=pd.Index(["Ohio", "Colorado"], name="state"),
    columns=pd.Index(["one", "two", "three"], name="number"),
)
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [22]:
data.stack()

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32